{
    "ABOUT": "In the nav bar. Opens the about modal",
    "ABOUT_CONTRIBUTORS": "In about menu, introduces those who worked on Scout-App.",
    "ABOUT_DEPENDENCIES": "In About modal. Scout-App uses libraries behind-the-scenes. This gives credit and links to those libraries. 'node-sass' and 'chokidar' are library names and likely shouldn't be translated. Use best judgement.",
    "ABOUT_DESCRIPTION": "In About modal. A simple description of what the app is used for.",
    "ABOUT_SCOUTAPP": "In About modal. There is a section for Scout-App and a section for UGUI. This is the title for the Scout-App section.",
    "ABOUT_VISIT_UPDATE": "Text that is followed by a link to the scout-app website.",
    "ADD_PROJECT": "In the sidebar. Allows the user to select a project folder on their computer. Then it adds the project to Scout-App.",
    "ALERT_TITLE": "When processing Sass to CSS, if there is an error in the user's Sass code, we display an alert with this as the title. 'Line' is what line of the file had the error. 'Col' is short for Column and is how many characters from the start of a line to find the error.",
    "APPLICATION_TITLE": "Shows in the title bar of the app window.",
    "BROWSE": "This is displayed when the user hovers over an element that can browse their computer for a file or folder.",
    "CANCEL": "When the user is removing a project they can choose 'Remove' or 'Cancel' as an action.",
    "CAT_SCREAMING_NO": "When the user is removing a project, an image of a cat is displayed. The cat looks like it is trying to stop something bad from happening at the last moment. This is the alternative text for the image, for those who are visually imparied.",
    "CHECK_FOR_UPDATES": "A button in the about menu to check for newer versions of Scout-App",
    "CONFIRM_DELETE": "When the user is removing a project we ask them to confirm with this. Then the user selects 'Remove' or 'Cancel'.",
    "DELETE": "When the user is removing a project they can choose 'Remove' or 'Cancel' as an action.",
    "DELETE_PROJECT": "In the project settings view, there is a button that allows you to remove the project from Scout-App.",
    "DESELECT_ALL": "When the user has no projects, we display a list of suggested projects to import. They can 'Select All' of them or 'Deselect All' of them.",
    "DEV_TOOLS": "In the View menu of the nav bar the user can click on 'Dev Tools' to launch Developer tools to debug Scout-App itself.",
    "DEVELOPMENT": "In the project settings view, under the Enivornment section the user can select either 'Development' or 'Production'. Which effects how their CSS will be outputted. Either with Sass mapping and line comments or without.",
    "ENVIRONMENT": "In the project settings view. This is a section heading that controls the way/format the user's CSS will be outputted. The pick bewteen a production or development environemnt. It is a choice of intent for the purpose of the processed CSS.",
    "EXIT": "In the File menu of the Nav Bar. This is a menu item that will close Scout-App if clicked.",
    "FILE": "This is a menu item in the nav bar, it contains a submenu of 'New Project', 'Preferences', and 'Exit'",
    "IMPORT_FROM_FOLDER": "When the user has no projects, we display a list of suggested projects to import. This explains what folder contains all the suggested projects. If no folder is found, we display 'Not Found'",
    "IMPORT_PROJECTS": "When the user has no projects, we display a list of suggested projects to import. This is the title for the section that contains the suggested projects.",
    "IMPORT_SELECTED": "When the user has no projects, we display a list of suggested projects to import. This is the confirmation button the user clicks when they want to import the selected suggested projects.",
    "INPUT_FOLDER": "In the project settings view, this is the label for the input field where the user sets their project's Sass folder",
    "MISSING_DATA": "In the sidebar. A project cannot be run if it is missing an input or output folder. So we display an icon and this hover text as an explanation.",
    "LANG_ENGLISH": "In the preferences modal, options for language choices.",
    "LANG_DANISH": "In the preferences modal, options for language choices.",
    "LANG_DUTCH": "In the preferences modal, options for language choices.",
    "LANG_FRENCH": "In the preferences modal, options for language choices.",
    "LANG_ITALIAN": "In the preferences modal, options for language choices.",
    "LANG_REDNECK": "In the preferences modal, options for language choices.",
    "LANG_RUSSIAN": "In the preferences modal, options for language choices.",
    "LANG_SPANISH": "In the preferences modal, options for language choices.",
    "LANGUAGE_CHOICE": "In the preferences modal, this is the label for the language dropdown.",
    "LATEST_VERSION": "In the About modal, after the user checks for updates, if there is no newer version available this is displayed.",
    "LISTING_OF_PROJECTS": "This is a label for the side bar for those who are visually impaired.",
    "MESSAGES_DESKTOP": "In the preferences, checkbox allowing you to set if messages or alerts pop up a desktop notification.",
    "MESSAGES_IN_APP": "In the preferences, checkbox allowing you to set if messages or alerts are displayed inside of Scout-App.",
    "MESSAGES_SOUND": "In the preferences, checkbox allowing you to set if messages or alerts play a sound when they occur.",
    "MESSAGES_TITLE_ERROR": "In the preferences, this is the label above the error message choices.",
    "MESSAGES_TITLE_SUCCESS": "In the preferences, this is the label above the success message choices.",
    "MILLISECONDS_SHORT": "When Scout-App successfully processes Sass files to CSS we output a message. When the user hovers over the message it states 'Project Name | Processed in 224 ms'",
    "NEW_PROJECT": "Under 'File' in the nav bar, this is an option. It lets the user browse for a project folder to add to Scout-App.",
    "NO_PROJECTS_FOUND": "When the user has no projects in Scout-App. If Scout-App can't find a folder containing the user's projects, it displays this message.",
    "NO_SASS_FILES": "When the user runs a project, but its input folder doesn't have any Sass files that can be processed, this error message is displayed.",
    "NOTIFICATIONS_CHOICE": "In the preferences modal, this is the label above the notification settings.",
    "OUTPUT_COMPACT": "In the project settings view, there is a setting for the level of compression for the outputted CSS. This is one of the options.",
    "OUTPUT_COMPRESSED": "In the project settings view, there is a setting for the level of compression for the outputted CSS. This is one of the options.",
    "OUTPUT_EXPANDED": "In the project settings view, there is a setting for the level of compression for the outputted CSS. This is one of the options.",
    "OUTPUT_FOLDER": "In the project settings view, this is the label for the input field where the user sets their project's CSS folder",
    "OUTPUT_NESTED": "In the project settings view, there is a setting for the level of compression for the outputted CSS. This is one of the options.",
    "OUTPUT_STYLE": "In the project settings view, there is a dropdown to pick the level of compression to use for outputted CSS files. This is the first option and the hover text.",
    "OUTPUT_WARNING": "In the project settings view. This is a warning message displayed when the user's input and output folders match or the output is a subfolder of the input.",
    "PREFERENCES": "In the File menu of the Nav Bar. This is a menu item that will show the Preferences modal if clicked.",
    "PROCESSED_IN_DURATION": "When Scout-App successfully processes Sass files to CSS we output a message. When the user hovers over the message it states 'Project Name | Processed in 224 ms'",
    "PRODUCTION": "In the project settings view, under the Enivornment section the user can select either 'Development' or 'Production'. Which effects how their CSS will be outputted. Either with Sass mapping and line comments or without.",
    "PROJECT_CONTROLS": "In the sidebar this is hidden text used for those who are visually impaired. It references the buttons below the listing of projects",
    "PROJECT_ICON": "In the project settings view, this is the alternative text for the project's icon for those who are visually impaired.",
    "SCOUTAPP_LOGO": "This is alternative text for the logo in the top left of the app for those using screen readers.",
    "SECONDS": "When Scout-App successfully processes Sass files to CSS we output a message. When you hover over the message it states 'Project Name | Processed in 1.2 seconds' if it takes longer than 500 miliseconds.",
    "SELECT_ALL": "When the user has no projects, we display a list of suggested projects to import. You can 'Select All' of them or 'Deselect All' of them.",
    "SERVER_DOWN": "In the About modal, after the user checks for updates, if there is no response, display this error.",
    "STATUS": "In the View menu of the Nav Bar. This is a menu item that will display the 'Status of all Projects' screen if clicked.",
    "STATUS_OF_ALL_PROJECTS": "This is the title of the 'Status of all Projects' screen, and is also used in the sidebar. This section displays all alerts and messages of projects that have been ran.",
    "STYLESHEET_CHOICE": "In the Preferences modal. This is a label for the theme dropdown that lets the user change the visual look of Scout-App.",
    "STYLESHEET_DIRECTORIES": "In the project settings view. This is a section heading that controls the way/format the user's CSS will be outputted.",
    "TOGGLE_NAVIGATION": "When you resize Scout-App to be smaller the nav bar hides. This is hidden text for those with visual impairments.",
    "TRANSLATED_BY": "In the Preferences modal. This is displayed under the Language dropdown and is followed by a the name of whoever translated that language.",
    "TRANSLATOR": "Who wrote the translations for Scout-App",
    "TRANSLATOR_MEME": "The alt text for the cultural image displayed when Scout-App's language is changed.",
    "TRANSLATOR_URL": "The URL that is opened when you click on the translator's name.",
    "UPDATE_FOUND": "In the About modal, after the user checks for updates, if a newer version is found, display this message.",
    "VERSION": "In the About modal, this is the hover text for the version number.",
    "VIEW": "Used in the nav bar",
    "VIEW_LATEST_RELEASE": "If check for updates finds a new version",
    "WELCOME_INSTRUCTIONS": "When there are no projects in Scout-App we auto-guess the user's projects folder. This message is displayed above the list of projects. Clicking the link in it lets you browse for a different projects folder.",
    "WELCOME_MESSAGE": "Larger header shown when you have no projects saved."
}
